package rauchenwald.geometrie.dreidimensional;

/**
 * Created by Felix on 05/11/2016.
 */
public class Würfel extends DreiDimensional
{
    //ATTRIBUTES
    //------------------------------------------------------------------------------------------------------------------
    private int sideA;
    //------------------------------------------------------------------------------------------------------------------


    //CONSTRUCTOR
    //------------------------------------------------------------------------------------------------------------------
    public Würfel(int x, int y, int sideA)
    {
        this.xKor = x;
        this.yKor = y;
        this.sideA = sideA;
    }
    //------------------------------------------------------------------------------------------------------------------


    //GETTER SETTER
    //------------------------------------------------------------------------------------------------------------------
    public int getSideA() { return sideA; }
    public void setSideA(int sideA) { this.sideA = sideA; }
    //------------------------------------------------------------------------------------------------------------------


    //METHODS
    //------------------------------------------------------------------------------------------------------------------
    public double calculateVolume() { return Math.pow(this.sideA, 3); }

    public double calculateSurfaceArea() { return 6 * Math.pow(this.sideA, 2); }
    //------------------------------------------------------------------------------------------------------------------


    //OVERRIDES
    //------------------------------------------------------------------------------------------------------------------
    @Override
    public boolean equals(Object o)
    {
        if (this == o) return true;
        if (o == null || getClass() != o.getClass()) return false;

        Würfel würfel = (Würfel) o;

        return sideA == würfel.sideA;
    }
    @Override
    public int hashCode() { return sideA; }
    //------------------------------------------------------------------------------------------------------------------

}
